#include "../../proj/tl_common.h"
#include "../../proj_lib/ble/ll/ll.h"
#include "../../proj_lib/ble/blt_config.h"
#include "../../proj_lib/ble/service/ble_ll_ota.h"
#include "spp.h"
#include "nv.h"
#include "./time_stamp/time_stamp.h"

#if(__PROJECT_8261_MODULE__ || __PROJECT_8266_MODULE__ || __PROJECT_8267_MODULE__ || __PROJECT_8269_MODULE__)

typedef struct
{
  /** Minimum value for the connection event (interval. 0x0006 - 0x0C80 * 1.25 ms) */
  u16 intervalMin;
  /** Maximum value for the connection event (interval. 0x0006 - 0x0C80 * 1.25 ms) */
  u16 intervalMax;
  /** Number of LL latency connection events (0x0000 - 0x03e8) */
  u16 latency;
  /** Connection Timeout (0x000A - 0x0C80 * 10 ms) */
  u16 timeout;
} gap_periConnectParams_t;


const u16 	clientCharacterCfgUUID = GATT_UUID_CLIENT_CHAR_CFG;
const u16 	extReportRefUUID = GATT_UUID_EXT_REPORT_REF;
const u16 	reportRefUUID = GATT_UUID_REPORT_REF;
const u16 	characterPresentFormatUUID = GATT_UUID_CHAR_PRESENT_FORMAT;
const u16 	my_primaryServiceUUID = GATT_UUID_PRIMARY_SERVICE;
static const u16 my_characterUUID = GATT_UUID_CHARACTER;
const u16 	my_devServiceUUID = SERVICE_UUID_DEVICE_INFORMATION;
const u16 	my_PnPUUID = CHARACTERISTIC_UUID_PNP_ID;
const u16 	my_devNameUUID = GATT_UUID_DEVICE_NAME;


//device information
const u16 	my_gapServiceUUID = SERVICE_UUID_GENERIC_ACCESS;
// Device Name Characteristic Properties
static u8 	my_devNameCharacter = CHAR_PROP_READ | CHAR_PROP_NOTIFY;
// Appearance Characteristic Properties
const u16 	my_appearanceUIID = 0x2a01;
const u16 	my_periConnParamUUID = 0x2a04;
static u8 	my_appearanceCharacter = CHAR_PROP_READ;
// Peripheral Preferred Connection Parameters Characteristic Properties
static u8 	my_periConnParamChar = CHAR_PROP_READ;
u16 		my_appearance = GAP_APPEARE_UNKNOWN;
gap_periConnectParams_t my_periConnParameters = {20, 40, 0, 1000};


const u16 	my_gattServiceUUID = SERVICE_UUID_GENERIC_ATTRIBUTE;
const u8  	serviceChangedProp = CHAR_PROP_INDICATE;
const u16 	serviceChangeUIID = GATT_UUID_SERVICE_CHANGE;
u16 		serviceChangeVal[2] = {0};
static u8 	indCharCfg[6] = {0x0b, 0x00, 0x02, 0x29};
const u16 	userdesc_UUID		= GATT_UUID_CHAR_USER_DESC;


#define 	DEV_NAME                       			"TNLKLock"
extern u8  	ble_devName[];


///////////////////// HemiaoLock /////////////////////////////////////////////
extern u32 	g_token;//Token
extern u8 	g_private_AES_key[16];
extern u32  g_current_time;
extern u16  g_serialNum;
extern u32  g_locked_time;
extern u16  g_curr_vol;
extern s16  g_curr_temp;
extern u16  g_curr_charge_vol;
extern u8   g_password[6];
extern u16  g_serial_num;
extern u8   g_GSM_ID[6];
extern u8   g_curr_lock_work_pattern;
extern u8   g_old_password[6];
extern u8   g_new_password[6];
extern u8   g_new_key[16];
extern u8   g_GSM_ver[GSM_VER_LEN];
extern u8   g_lock_ICCID[LOCK_ICCID_LEN];
extern u8   g_lock_IMEI[LOCK_IMEI_LEN];
extern u8   g_lock_SN[LOCK_SN_LEN];
extern u8   g_lock_domains[LOCK_DOMAIN_LEN];
extern u8   g_is_order_num_unlock;
extern Flag_t Flag;
extern device_state_t device_state;
extern BJ_Time_t BJ_Time;
extern nv_params_t *nv_params_ptr;

extern void AES_ECB_Encryption(u8 *key, u8 *plaintext, u8 *encrypted_data);
extern void AES_ECB_Decryption(u8 *key, u8 *encrypted_data, u8 *decrypted_data);
extern BJ_Time_t get_RTC_value(void);



////////////////////////////////////// lock service /////////////////////////////////////
const u16 	BleLockServiceUUID         				= 0xFEE7;
const u16 	BleLockChar1UUID         				= 0x36F5;
const u16 	BleLockChar2UUID         				= 0x36F6;
static u8 	BleLockChar1Prop 				 		= CHAR_PROP_WRITE | CHAR_PROP_WRITE_WITHOUT_RSP;
u8  		BleLockChar1Data[ATT_MTU_SIZE - 3];
static u8 	BleLockChar2Prop 				 		= CHAR_PROP_READ | CHAR_PROP_NOTIFY;
u8  		BleLockChar2Data[ATT_MTU_SIZE - 3];
static u8   BleLockChar2DataCCC[2]					={0};

#if SUPPORT_WETCHAT_ENABLE//if support wechat,
const u16 	BleLockChar3UUID         				= 0xFEC7;
const u16 	BleLockChar4UUID         				= 0xFEC8;
const u16 	BleLockChar5UUID         				= 0xFEC9;
static u8 	BleLockChar3Prop 				 		= CHAR_PROP_WRITE;
u8  		BleLockChar3Data[ATT_MTU_SIZE - 3];
static u8 	BleLockChar4Prop 				 		= CHAR_PROP_READ | CHAR_PROP_INDICATE;
static u8   BleLockChar4DataCCC[2]					={0};
u8  		BleLockChar4Data[ATT_MTU_SIZE - 3];
static u8 	BleLockChar5Prop 				 		= CHAR_PROP_READ;
u8  		BleLockChar5Data[ATT_MTU_SIZE - 3];
#endif


#define     BleLockChar2DataHdl                     0x10



//获取令牌指令后返回：  06 02 LEN TOKEN[4] CHIP_TP VER[2] IDL IDH FILL[4]
typedef struct
{
	u8  tokenack0;          //固定为令牌返回标识
	u8  tokenack1;
	u8	len;				//LEN 为后续有效字节数
	u32 curToken;			//4个字节的令牌
	u8	chipType;           //芯片类型，由物联锁统一进行分配和管理；
	u8  ver_major;          //版本号,如01 03 ，这里理解为 1.3 版，由固件工程师自行维护；
	u8	ver_minor;
	u8  productID_IDL;      //IDL 和 IDH 是产品编号
	u8  productID_IDH;
	u32 rsvd;
}token_packet_ack_t;

//获取同步时间指令后返回：  06 04 01 RET FILL[12]
typedef struct{
	u8 tokenack0;    //06
	u8 tokenack1;	 //04
	u8 tokenack2;	 //01
	u8 ret;          //RET 为状态返回，00 表示同步成功，01 表示同步失败。
	u8 rsvd[12];
}sync_time_ack_t;

//获取查询关锁时间指令后返回： 06 06 06 NO[2] TIME[4] FILL[7]
typedef struct{
	u8 tokenack0;    //06
	u8 tokenack1;	 //06
	u8 tokenack2;	 //06
	u16 serialNum;   //流水号
	u32 lastLockTime;//最后一次关锁的时间
	u8 rsvd[7];
}query_lock_time_ack_t;

//获取电池电压及温度指令后返回： 02 02 01 VL VOLT TL TEMP FILL[7]
typedef struct{
	u8 tokenack0;    //02
	u8 tokenack1;	 //02
	u8 tokenack2;	 //01
	u8 vl;           //VL为电压值VOLT的长度，
	u16 volt;        //电压值
	u8 tl;           //TL为温度TEMP长度
	s16 temp;        //温度，TEMP为短整型，包括负值。
	u8 rsvd[7];
}get_vol_temp_ack_t;

//获取内外部电量指令后返回： 02 02 02 VL VOLT TL TEMP CL CHARGE FILL[4]
typedef struct{
	u8 tokenack0;    //02
	u8 tokenack1;	 //02
	u8 tokenack2;	 //02
	u8 vl;           //VL为电压值VOLT的长度，
	u16 volt;        //电压值
	u8 tl;           //TL为温度TEMP长度
	s16 temp;        //温度，TEMP为短整型，包括负值。
	u8 cl;           //CL为温度CHARGE长度
	u16 charge;      //充电电压
	u8 rsvd[4];
}get_int_ext_electricity_ack_t;

//查询锁状态指令后返回： 05 0f 01 STA FILL[12]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //0f
	u8 tokenack2;	 //01
	u8 sta;          //STA 为锁状态，00 表示开启状态，01 表示关闭状态。
	u8 rsvd[12];
}query_lock_status_ack_t;

//设置还车状态指令后返回： 05 15 01 RET FILL[12]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //15
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示设置成功，01 表示设置失败。
	u8 rsvd[12];
}set_return_car_status_ack_t;

//查询锁的工作模式指令后返回： 05 20 01 MOD FILL[12]
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //20
	u8 tokenack2;	 //01
	u8 MOD;          //MOD 为锁工作模式，00 表示正常模式，01 表示运输模式。
	u8 rsvd[12];
}get_lock_work_pattern_ack_t;

//设置锁的工作模式指令后返回： 05 21 01  FILL[12]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //21
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示设置成功，01 表示设置失败。
	u8 rsvd[12];
}set_lock_work_pattern_ack_t;

//////////////// 查询锁的工作状态 //////////////////////
//R0
//define at file: app_config.h line 30~45
typedef union
{
	struct
	{
		u8 lock_switch_status : 1;
		u8 Gsensor_func       : 1;//振动功能
		u8 Gsensor_is_vibrating : 1;
		u8 battery_is_charging  : 1;
	};
	u8 g_status_byte;//R[0] 为状态字节
}work_status_R0_t;
//R1
u8 g_GSM_status;//R[1] 为 GSM 状态，
enum work_status_R1{//为 GSM 状态
	switch_off = 0,//表示关电状态
	query_SIM_card,//表示查询 SIM 卡
	reg_network,   //注册网络
	init_SMS_func, //初始化短信功能
	query_GPRS_network, //查询 GPRS 网络
	conn_PPP,      //连接PPP
	conn_TCP,      //连接TCP
	conn_platform_sucess,//与平台通讯成功
	power_on = 0xfe,      //已经上电
};
//R2
u8 g_last_GPRS_online_need_time;//R[2] 为上一次GPRS 上线需要的时间
//R3
u8 g_last_GPRS_rssi_val;//R[3] 为上一次GSM 信号强度值
//R4
u8 g_GPS_status;//R[4] 为 GPS 状态，00 表示关电状态，01 表示未定位，02 表示已定位，FF 表示故障。
enum work_status_R4{//为 GPS 状态
	power_off,//关电状态
	un_positioned,//未定位
	positioned,//已经定位
	lock_fault = 0xff, //故障
};
//R5
u8 g_last_GPS_location_need_time;//R[5] 为上一次GPS 定位需要的时间
//R6
u8 g_last_GPS_stars_received_num;//R[6] 为上一次GPS 的收星数量。

typedef struct
{
	//R[0~6]
	work_status_R0_t R0;
	u8 R1_GSM_status;
	u8 R2_last_GPRS_online_need_time;
	u8 R3_last_GPRS_rssi_val;
	u8 R4_GPS_status;
	u8 R5_last_GPS_location_need_time;
	u8 R6_last_GPS_stars_received_num;
}get_lock_work_status_R0_R6_t;

//查询锁的工作状态指令后返回： 05 22 08 R[7] VL VOLT TL TEMP
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //22
	u8 tokenack2;	 //08
	get_lock_work_status_R0_R6_t R;
	u8 vl;//VL为电压值VOLT的长度
	u16 volt;
	u8 tl;//TL为温度TEMP长度，TEMP为短整型，包括负值。
	s16 temp;
}get_lock_work_status_ack_t;
//////////////////////////////////////////////////////////////

//查询锁的 GSM ID指令后返回： 05 23 06 ID[6]  FILL[7]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //23
	u8 tokenack2;	 //06
	u8 GSM_ID[6];    //ID 为 GSM ID 号。
	u8 rsvd[7];
}get_GSM_ID_ack_t;

//查询锁的 GSM 版本号指令后返回： 05 24 01 N VER[N]
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //24
	u8 tokenack2;	 //01
	u8 N;            //N 为 GSM 版本号字节数
	u8 ver[12];      //VER 为 GSM 版本号，其字节数是不固定的，通常为 ASCII 字符。
}get_GSM_VER_ack_t;
//查询锁的 ICCID指令后返回： 05 28  L ICCID
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //28
	u8 L;            //L为ICCID字节数
	u8 iccid[13];    //可能为多帧
}get_ICCID_ack_t;
//查询锁的 ICCID指令后返回： 05 29  L IMEI
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //29
	u8 L;            //L为IMEI字节数
	u8 imei[13];    //可能为多帧
}get_IMEI_ack_t;
//查询锁的 SN指令后返回： 05 41  L SN
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //41
	u8 L;            //L为IMEI字节数
	u8 SN[13];       //可能为多帧
}get_SN_ack_t;
//查询锁的域名指令后返回： 05 30 T CI DOMAIN[12]
typedef struct
{
	u8 tokenack0;    //05
	u8 tokenack1;	 //30
	u8 T;	         //T为域名总长度
	u8 CI;           //CI为当前序号（从0开始计数）
	u8 DOMAIN[50];      //DOMAIN为锁的域名，通常为 ASCII 字符。
}get_lock_domains_ack_t;

//开锁指令后返回： 05 02 01 RET TL YY YY MM DD HH mm ss FILL[4]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //02
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示开锁成功，01 表示开锁失败
	u8 tl;           //TL为时间长度，其中年份占2个字节，其余月日时分秒各一个字节
	BJ_Time_t rtc;
	u8 rsvd[4];
}open_lock_ack_t;

//流水号开锁指令后返回： 05 32 01 RET FILL[12]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //32
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示开锁成功，01 表示开锁失败
	u8 rsvd[12];
}serial_number_lock_ack_t;

//订单号开锁指令后返回： 05 13 01 RET TL YY YY MM DD HH mm ss FILL[4]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //13
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示开锁成功，01 表示开锁失败
	u8 tl;           //TL为时间长度，其中年份占2个字节，其余月日时分秒各一个字节
	BJ_Time_t rtc;
	u8 rsvd[4];
}order_num_unlock_ack_t;

/////////////////////// 订单号开锁后再进行手动关锁，锁自动发送包含订单号的通信帧 //////////////////////
//订单号开锁后再进行手动关锁，锁自动发送包含订单号的通信帧。锁返回通信帧:
//transmit1: 05 14 01 RET TL YY YY MM DD HH mm ss FILL[4]
//transmit2: 05 15 T CI ORDER[12]
//transmit3: 05 15 T CI ORDER[?]
//...根据订单号长度定
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //14
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示关锁成功，01 表示关锁失败
	u8 tl;           //TL为时间长度，其中年份占2个字节，其余月日时分秒各一个字节
	BJ_Time_t rtc;
	u8 rsvd[4];
}order_num_lock_send1_t;
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //15
	u8 T;            //T为订单号总长度
	u8 CI;           //CI为发送序列的序号（从0开始计数）
    u8 order[12];    //ORDER为ASCII 字符。
}order_num_lock_send2_t;
/////////////////////////////////////////////////////////////////////////////////////////////

//修改密码指令后返回： 05 05 01 RET FILL[12]
typedef struct{
	u8 tokenack0;    //05
	u8 tokenack1;	 //05
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示修改密码成功，01 表示修改密码失败
	u8 rsvd[12];
}modify_pwd_ack_t;

//修改密钥指令后返回： 07 03 01 RET FILL[12]
typedef struct{
	u8 tokenack0;    //07
	u8 tokenack1;	 //03
	u8 tokenack2;	 //01
	u8 RET;          //RET 为状态返回，00 表示修改密钥成功，01 表示修改密钥失败
	u8 rsvd[12];
}modify_key_ack_t;


u8 order[24];//单号缓存数组24byts,根据实际修改
u8 order_len;
u8 tmp_order_len;


//订单号开锁后再进行手动关锁，锁自动发送包含订单号的通信帧。锁返回通信帧：
u8 order_num_lock_notify2master(void){
	u8 encrypted_data[16];
	if(g_is_order_num_unlock){
		g_is_order_num_unlock = 0;

		order_num_lock_send1_t order_num_lock_send1;
		order_num_lock_send1.tokenack0 = 0x05;
		order_num_lock_send1.tokenack1 = 0x14;
		order_num_lock_send1.tokenack2 = 0x01;
		//TODO:实际电机控制锁关闭后，需要立即更新全局变量g_curr_lock_state
		order_num_lock_send1.tl = 7; //TL为时间长度，其中年份占2个字节，其余月日时分秒各一个字节。
		order_num_lock_send1.RET = device_state.lock_onoff_state;//RET 为状态返回，00 表示关锁成功，01 表示关锁失败
		order_num_lock_send1.rtc = GET_RTC_VAL();

		//send cmd1 data
		AES_ECB_Encryption(g_private_AES_key, (u8*)&order_num_lock_send1, encrypted_data);
		bls_att_pushNotifyData(BleLockChar2DataHdl, encrypted_data, 16);

		//send left data
		order_num_lock_send2_t order_num_lock_send2;
